In [5]:
from pandas import DataFrame

78 - Dataframe

In [6]:
data = {
    "Name" : ["Asep", "John", "Sam"],
    "Age"  : [20, 30, 15],
    "Salary" : [5000, 6000, 2000],
}

In [7]:
df = DataFrame(data)
df

   Name  Age  Salary
0  Asep   20    5000
1  John   30    6000
2   Sam   15    2000

79 - Changing Column

In [8]:
newframe = DataFrame(data, columns=['Age', 'Name', 'Salary', 'Profile'])
newframe

   Age  Name  Salary Profile
0   20  Asep    5000     NaN
1   30  John    6000     NaN
2   15   Sam    2000     NaN

In [9]:
newframe["Salary"]

0    5000
1    6000
2    2000
Name: Salary, dtype: int64

In [10]:
newframe.loc[1]

Age          30
Name       John
Salary     6000
Profile     NaN
Name: 1, dtype: object

80 - Changing and Transposing Column

In [12]:
newframe['Profile']="Content Creator"
newframe

   Age  Name  Salary          Profile
0   20  Asep    5000  Content Creator
1   30  John    6000  Content Creator
2   15   Sam    2000  Content Creator

In [13]:
newframe['Education'] = 'Bachelor'
newframe

   Age  Name  Salary          Profile Education
0   20  Asep    5000  Content Creator  Bachelor
1   30  John    6000  Content Creator  Bachelor
2   15   Sam    2000  Content Creator  Bachelor

In [19]:
newframe = newframe.T
newframe

  Age  Name Salary          Profile Education
0  20  Asep   5000  Content Creator  Bachelor
1  30  John   6000  Content Creator  Bachelor
2  15   Sam   2000  Content Creator  Bachelor

81 - Reindexing Series & DataFrame

In [46]:
from pandas import Series

In [47]:
obj = Series([100, 200, 300, 400, 500], index=['a', 'b', 'c', 'd', 'e'])
obj

a    100
b    200
c    300
d    400
e    500
dtype: int64

In [48]:
obj = obj.reindex(['c', 'a', 'b', 'e', 'd'])

In [49]:
frame = {
    "Name" : ["Asep", "Joko", "Udin"],
    "Age"  : [20, 30, 25],
    "Salary" : [4000,3000,6000],
}
framer = DataFrame(frame)
framer

   Name  Age  Salary
0  Asep   20    4000
1  Joko   30    3000
2  Udin   25    6000

In [50]:
framer = framer.reindex([2,0,1])
framer

   Name  Age  Salary
2  Udin   25    6000
0  Asep   20    4000
1  Joko   30    3000

In [51]:
fields = ["Age", "Name", "Salary"]
framer = framer.reindex(columns=fields)
framer

   Age  Name  Salary
2   25  Udin    6000
0   20  Asep    4000
1   30  Joko    3000

82 - Deleting Row & Collumn

In [52]:
framer2 = framer.drop([1])
framer2

   Age  Name  Salary
2   25  Udin    6000
0   20  Asep    4000

In [60]:
framer3 = framer.drop('Salary', axis=1)
framer3

   Age  Name
2   25  Udin
0   20  Asep
1   30  Joko

83 - Aritmathic Operations on Series and DataFrame

In [63]:
series1 = Series([1, 2, 3, 4, 5])
series2 = Series([100,200,300,400,500, 600])
series1 + series2

0    101.0
1    202.0
2    303.0
3    404.0
4    505.0
5      NaN
dtype: float64

In [64]:
data1 = {
    "speed" : [200, 300, 400],
    "temp"  : [20, 22, 21],
}
frame1 = DataFrame(data1)
frame1

   speed  temp
0    200    20
1    300    22
2    400    21

In [65]:
data2 = {
    "humidity" : [40, 50, 60],
    "speed" : [200, 300, 400],
    "temp"  : [20, 22, 21],
}
frame2 = DataFrame(data2)
frame2

   humidity  speed  temp
0        40    200    20
1        50    300    22
2        60    400    21

In [66]:
frame1 + frame2

   humidity  speed  temp
0       NaN    400    40
1       NaN    600    44
2       NaN    800    42

84 - Aritmathic DataFrame to Series

In [68]:
series3 = Series([100,200,300], index=['humidity', 'speed', 'temp'])
series3

humidity    100
speed       200
temp        300
dtype: int64

In [69]:
data2 = {
    "humidity" : [40, 50, 60],
    "speed" : [200, 300, 400],
    "temp"  : [20, 22, 21],
}
frame2 = DataFrame(data2)
frame2

   humidity  speed  temp
0        40    200    20
1        50    300    22
2        60    400    21

In [71]:
frame2 - series3

   humidity  speed  temp
0       -60      0  -280
1       -50    100  -278
2       -40    200  -279

85 - Sorting Series and Dataframe

In [72]:
ser = Series([1, 4, 6, 5], index=[6,4,2,3])
ser

6    1
4    4
2    6
3    5
dtype: int64

In [75]:
ser.sort_index()

2    6
3    5
4    4
6    1
dtype: int64

In [78]:
data2 = {
    "humidity" : [40, 50, 60],
    "speed" : [200, 300, 400],
    "temp"  : [20, 22, 21],
}
frame2 = DataFrame(data2)
frame2 = frame2.reindex([2,0,1])
frame2

   humidity  speed  temp
2        60    400    21
0        40    200    20
1        50    300    22

In [83]:
frame2.sort_index(axis=0, ascending=True)

   humidity  speed  temp
0        40    200    20
1        50    300    22
2        60    400    21

86 - Sorting According to Value

In [84]:
ser = Series([1000, 5000, 2400, 6000])
ser

0    1000
1    5000
2    2400
3    6000
dtype: int64

In [85]:
ser.sort_values()

0    1000
2    2400
1    5000
3    6000
dtype: int64

In [89]:
frame2.sort_values(by='speed')

   humidity  speed  temp
0        40    200    20
1        50    300    22
2        60    400    21

87 - Handling Values

In [93]:
series = Series([100,200,300,400], index=["a", "b", "d", "d"])
series

a    100
b    200
d    300
d    400
dtype: int64

In [99]:
series.index.is_unique

False

88 - Calculate SUM MAX MIN

In [104]:
frame2.sum(axis=1)

2    481
0    260
1    372
dtype: int64

In [106]:
frame2.idxmax()

humidity    2
speed       2
temp        1
dtype: int64

In [108]:
frame2.idxmin()

humidity    0
speed       0
temp        0
dtype: int64

89 - Dropping NaN Values

In [109]:
import numpy as np

In [110]:
ser = Series([1,2,3,4, np.nan], index=["a", "b", "c", "d", "e"])
ser

a    1.0
b    2.0
c    3.0
d    4.0
e    NaN
dtype: float64

In [111]:
ser.dropna()

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

In [112]:
data2 = {
    "humidity" : [40, np.nan, 60],
    "speed" : [200, 300, 400],
    "temp"  : [20, np.nan, 21],
}
frame2 = DataFrame(data2)
frame2 = frame2.reindex([2,0,1])
frame2

   humidity  speed  temp
2      60.0    400  21.0
0      40.0    200  20.0
1       NaN    300   NaN

In [115]:
frame2.dropna()

   humidity  speed  temp
2      60.0    400  21.0
0      40.0    200  20.0

In [117]:
frame2.fillna(100)

   humidity  speed   temp
2      60.0    400   21.0
0      40.0    200   20.0
1     100.0    300  100.0

90 - Loading Data from File

In [118]:
import pandas as pd

In [119]:
df = pd.read_csv("products_data.csv")
df

,kode_barang,sektor,nama_barang,tipe,nama_tipe,kode_lini,lini,kemasan
0,BRG0001,P,ACYCLOVIR DUS,ZPJ1,Produk jadi,206,OGB & PH,DUS
1,BRG0002,P,ALERGINE TABLET SALUT,ZPJ1,Produk jadi,203,ETIKAL,DUS
2,BRG0003,P,AMPICILLIN,ZPJ1,Produk jadi,210,MARCKS,BOTOL
3,BRG0004,P,TRAMADOL KAPSUL 50 MG,ZPJ1,Produk jadi,201,VNS,KAPSUL
4,BRG0005,P,KLORPROMAZINA TABLET SALUT SELAPUT 100 MG,ZPJ1,Produk jadi,203,SLCYL,TABLET
5,BRG0006,P,KETOCONAZOLE TABLET 200 MG,ZPJ1,Produk jadi,205,OGB & PH,TABLET
6,BRG0007,P,ERGOTAMINE COFFEINE,ZPJ1,Produk jadi,206,ETIKAL,BOTOL
7,BRG0008,P,TETRACYCLINE KAPSUL 250 MG,ZPJ1,Produk jadi,204,MARCKS,KAPSUL
8,BRG0009,P,AMBROXOL HC,ZPJ1,Produk jadi,207,VNS,BOTOL
9,BRG0010,P,PARACETAMOL,ZPJ1,Produk jadi,208,SLCYL,BOTOL

91 - Analyzing Data

In [130]:
df = pd.DataFrame(df)
df = df.dropna()
df

,kode_barang,sektor,nama_barang,tipe,nama_tipe,kode_lini,lini,kemasan
0,BRG0001,P,ACYCLOVIR DUS,ZPJ1,Produk jadi,206,OGB & PH,DUS
2,BRG0003,P,AMPICILLIN,ZPJ1,Produk jadi,210,MARCKS,BOTOL
3,BRG0004,P,TRAMADOL KAPSUL 50 MG,ZPJ1,Produk jadi,201,VNS,KAPSUL
4,BRG0005,P,KLORPROMAZINA TABLET SALUT SELAPUT 100 MG,ZPJ1,Produk jadi,203,SLCYL,TABLET
5,BRG0006,P,KETOCONAZOLE TABLET 200 MG,ZPJ1,Produk jadi,205,OGB & PH,TABLET
6,BRG0007,P,ERGOTAMINE COFFEINE,ZPJ1,Produk jadi,206,ETIKAL,BOTOL
7,BRG0008,P,TETRACYCLINE KAPSUL 250 MG,ZPJ1,Produk jadi,204,MARCKS,KAPSUL
8,BRG0009,P,AMBROXOL HC,ZPJ1,Produk jadi,207,VNS,BOTOL
9,BRG0010,P,PARACETAMOL,ZPJ1,Produk jadi,208,SLCYL,BOTOL

In [133]:
df = df.drop('nama_tipe', axis=1)
df

,kode_barang,sektor,nama_barang,tipe,kode_lini,lini,kemasan
0,BRG0001,P,ACYCLOVIR DUS,ZPJ1,206,OGB & PH,DUS
2,BRG0003,P,AMPICILLIN,ZPJ1,210,MARCKS,BOTOL
3,BRG0004,P,TRAMADOL KAPSUL 50 MG,ZPJ1,201,VNS,KAPSUL
4,BRG0005,P,KLORPROMAZINA TABLET SALUT SELAPUT 100 MG,ZPJ1,203,SLCYL,TABLET
5,BRG0006,P,KETOCONAZOLE TABLET 200 MG,ZPJ1,205,OGB & PH,TABLET
6,BRG0007,P,ERGOTAMINE COFFEINE,ZPJ1,206,ETIKAL,BOTOL
7,BRG0008,P,TETRACYCLINE KAPSUL 250 MG,ZPJ1,204,MARCKS,KAPSUL
8,BRG0009,P,AMBROXOL HC,ZPJ1,207,VNS,BOTOL
9,BRG0010,P,PARACETAMOL,ZPJ1,208,SLCYL,BOTOL

In [135]:
df = df.sort_values(by='kode_lini')
df

,kode_barang,sektor,nama_barang,tipe,kode_lini,lini,kemasan
3,BRG0004,P,TRAMADOL KAPSUL 50 MG,ZPJ1,201,VNS,KAPSUL
4,BRG0005,P,KLORPROMAZINA TABLET SALUT SELAPUT 100 MG,ZPJ1,203,SLCYL,TABLET
7,BRG0008,P,TETRACYCLINE KAPSUL 250 MG,ZPJ1,204,MARCKS,KAPSUL
5,BRG0006,P,KETOCONAZOLE TABLET 200 MG,ZPJ1,205,OGB & PH,TABLET
0,BRG0001,P,ACYCLOVIR DUS,ZPJ1,206,OGB & PH,DUS
6,BRG0007,P,ERGOTAMINE COFFEINE,ZPJ1,206,ETIKAL,BOTOL
8,BRG0009,P,AMBROXOL HC,ZPJ1,207,VNS,BOTOL
9,BRG0010,P,PARACETAMOL,ZPJ1,208,SLCYL,BOTOL
2,BRG0003,P,AMPICILLIN,ZPJ1,210,MARCKS,BOTOL

In [137]:
df.sum(numeric_only=False)
df

,kode_barang,sektor,nama_barang,tipe,kode_lini,lini,kemasan
3,BRG0004,P,TRAMADOL KAPSUL 50 MG,ZPJ1,201,VNS,KAPSUL
4,BRG0005,P,KLORPROMAZINA TABLET SALUT SELAPUT 100 MG,ZPJ1,203,SLCYL,TABLET
7,BRG0008,P,TETRACYCLINE KAPSUL 250 MG,ZPJ1,204,MARCKS,KAPSUL
5,BRG0006,P,KETOCONAZOLE TABLET 200 MG,ZPJ1,205,OGB & PH,TABLET
0,BRG0001,P,ACYCLOVIR DUS,ZPJ1,206,OGB & PH,DUS
6,BRG0007,P,ERGOTAMINE COFFEINE,ZPJ1,206,ETIKAL,BOTOL
8,BRG0009,P,AMBROXOL HC,ZPJ1,207,VNS,BOTOL
9,BRG0010,P,PARACETAMOL,ZPJ1,208,SLCYL,BOTOL
2,BRG0003,P,AMPICILLIN,ZPJ1,210,MARCKS,BOTOL